## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 9 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                            |
|--------|------------------------------------------------------------|
| update | `aws_alb.notification-canada-ca`                           |
|        | `aws_eks_cluster.notification-canada-ca-eks-cluster`       |
|        | `aws_eks_node_group.notification-canada-ca-eks-node-group` |
|        | `aws_iam_openid_connect_provider.notification-canada-ca`   |
|        | `aws_iam_role.notification-service-account-role`           |
|        | `aws_kinesis_firehose_delivery_stream.firehose-waf-logs`   |
|        | `aws_security_group.notification-canada-ca-alb`            |
|        | `aws_security_group.notification-canada-ca-worker`         |
|        | `aws_wafv2_web_acl.notification-canada-ca`                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.eks-assume-role-policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks-assume-role-policy"  {
      ~ id      = "2728957943" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub = "system:serviceaccount:notification-canada-ca:notification-service-account"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }
    }

  # data.aws_security_group.eks-securitygroup-rds will be read during apply
  # (config refers to values not yet known)
 <= data "aws_security_group" "eks-securitygroup-rds"  {
      ~ arn         = "arn:aws:ec2:ca-central-1:239043911459:security-group/sg-0e2c3ef6c5c75b74c" -> (known after apply)
      ~ description = "EKS created security group applied to ENI that is attached to EKS Control Plane master nodes, as well as any managed workloads." -> (known after apply)
        id          = "sg-0e2c3ef6c5c75b74c"
      ~ name        = "eks-cluster-sg-notification-canada-ca-staging-eks-cluster-1914876598" -> (known after apply)
      ~ tags        = {
          - "Name"                                                             = "eks-cluster-sg-notification-canada-ca-staging-eks-cluster-1914876598"
          - "kubernetes.io/cluster/notification-canada-ca-staging-eks-cluster" = "owned"
        } -> (known after apply)
      ~ vpc_id      = "vpc-097508d1f5e243195" -> (known after apply)
    }

  # data.tls_certificate.notification-canada-ca will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "notification-canada-ca"  {
      ~ certificates = [
          - {
              - is_ca                = true
              - issuer               = "OU=Starfield Class 2 Certification Authority,O=Starfield Technologies\\, Inc.,C=US"
              - not_after            = "2034-06-28T17:39:16Z"
              - not_before           = "2009-09-02T00:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "12037640545166866303"
              - sha1_fingerprint     = "9e99a48a9960b14926bb7f3b02e22da2b0ab7280"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=Starfield Services Root Certificate Authority - G2,O=Starfield Technologies\\, Inc.,L=Scottsdale,ST=Arizona,C=US"
              - version              = 3
            },
          - {
              - is_ca                = true
              - issuer               = "CN=Starfield Services Root Certificate Authority - G2,O=Starfield Technologies\\, Inc.,L=Scottsdale,ST=Arizona,C=US"
              - not_after            = "2037-12-31T01:00:00Z"
              - not_before           = "2015-05-25T12:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "144918191876577076464031512351042010504348870"
              - sha1_fingerprint     = "06b25927c42a721631c1efd9431e648fa62e1e39"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=Amazon Root CA 1,O=Amazon,C=US"
              - version              = 3
            },
          - {
              - is_ca                = true
              - issuer               = "CN=Amazon Root CA 1,O=Amazon,C=US"
              - not_after            = "2030-08-23T22:21:28Z"
              - not_before           = "2022-08-23T22:21:28Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "166129328851546858514271303855646110030630415"
              - sha1_fingerprint     = "2ad974a775f73cbdbbd8f5ac3a49255fa8fb1f8c"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=Amazon RSA 2048 M01,O=Amazon,C=US"
              - version              = 3
            },
          - {
              - is_ca                = false
              - issuer               = "CN=Amazon RSA 2048 M01,O=Amazon,C=US"
              - not_after            = "2023-06-13T23:59:59Z"
              - not_before           = "2023-02-22T00:00:00Z"
              - public_key_algorithm = "RSA"
              - serial_number        = "20595014567600040394368449291577742930"
              - sha1_fingerprint     = "9a7a11f20416c58b82a9431a173c3a51bd2761c2"
              - signature_algorithm  = "SHA256-RSA"
              - subject              = "CN=oidc.eks.ca-central-1.amazonaws.com"
              - version              = 3
            },
        ] -> (known after apply)
      ~ id           = "2023-03-31 19:31:51.672326131 +0000 UTC" -> (known after apply)
      - verify_chain = true -> null
        # (1 unchanged attribute hidden)
    }

  # aws_alb.notification-canada-ca will be updated in-place
  ~ resource "aws_alb" "notification-canada-ca" {
        id                               = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:loadbalancer/app/notification-staging-alb/81d71deedddc8281"
        name                             = "notification-staging-alb"
      ~ tags                             = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
            # (1 unchanged element hidden)
        }
      ~ tags_all                         = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
            # (1 unchanged element hidden)
        }
        # (17 unchanged attributes hidden)


        # (4 unchanged blocks hidden)
    }

  # aws_eks_cluster.notification-canada-ca-eks-cluster will be updated in-place
  ~ resource "aws_eks_cluster" "notification-canada-ca-eks-cluster" {
        id                        = "notification-canada-ca-staging-eks-cluster"
        name                      = "notification-canada-ca-staging-eks-cluster"
      ~ tags                      = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
            # (1 unchanged element hidden)
        }
      ~ tags_all                  = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_eks_node_group.notification-canada-ca-eks-node-group will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group" {
        id              = "notification-canada-ca-staging-eks-cluster:notification-canada-ca-staging-eks-primary-node-group"
      ~ tags            = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
            # (1 unchanged element hidden)
        }
      ~ tags_all        = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_iam_openid_connect_provider.notification-canada-ca will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "notification-canada-ca" {
        id              = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
        tags            = {}
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role.notification-service-account-role will be updated in-place
  ~ resource "aws_iam_role" "notification-service-account-role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub = "system:serviceaccount:notification-canada-ca:notification-service-account"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "notification-service-account-role"
        name                  = "notification-service-account-role"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_kinesis_firehose_delivery_stream.firehose-waf-logs will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "firehose-waf-logs" {
        id             = "arn:aws:firehose:ca-central-1:239043911459:deliverystream/aws-waf-logs-notification-canada-ca-waf"
        name           = "aws-waf-logs-notification-canada-ca-waf"
      ~ tags           = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
            # (1 unchanged element hidden)
        }
      ~ tags_all       = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_security_group.notification-canada-ca-alb will be updated in-place
  ~ resource "aws_security_group" "notification-canada-ca-alb" {
        id                     = "sg-0f552df1be0a87d88"
        name                   = "notification-canada-ca-alb"
      ~ tags                   = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
        }
      ~ tags_all               = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.notification-canada-ca-worker will be updated in-place
  ~ resource "aws_security_group" "notification-canada-ca-worker" {
        id                     = "sg-0fcd9ca1bc66e469c"
        name                   = "notification-canada-ca-worker"
      ~ tags                   = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
        }
      ~ tags_all               = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_wafv2_web_acl.notification-canada-ca will be updated in-place
  ~ resource "aws_wafv2_web_acl" "notification-canada-ca" {
        id          = "d7f2eabc-ee4e-4c8d-b262-97f5370b5555"
        name        = "notification-canada-ca-waf"
      ~ tags        = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
        }
      ~ tags_all    = {
          - "CostCenter" = "notification-canada-ca-staging" -> null
          + "CostCentre" = "notification-canada-ca-staging"
        }
        # (5 unchanged attributes hidden)


        rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 9 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-sms-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-sms-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
